# NLS_MESSAGEFORMAT_NONE
# NLS_ENCODING=UTF-8
ExtName=[G'\uff29\uff22\uff2d \uff23\uff4f\uff4e\uff54ainer Service\u0e0f\u0e39\u0130\u0131\uff5c]
ExtDesc=[G'\uff30\uff52\uff4f\uff56\uff49\uff44\uff45\uff53 \uff41 \uff53\uff45\uff54 \uff4f\uff46 \uff44\uff45\uff46\uff41\uff55\uff4c\uff54 \uff44\uff45\uff50\uff4c\uff4f\uff59\uff4d\uff45\uff4e\uff54 \uff50\uff41\uff54\uff54\uff45\uff52\uff4e\uff53 \uff46\uff4f\uff52 \uff23\uff4f\uff4e\uff54\uff41\uff49\uff4e\uff45\uff52\uff53 on the IBM Container Service.  Containers are typically built using the Docker Builder, and images are stored in the tenants Container Registry.\u0e0f\u0e39\u0130\u0131\uff5c]
ExtMessage=[G'(\uff22\uff45\uff54\uff41)\uff29\uff4e\uff46\uff4f\uff52\uff4d\uff41\uff54\uff49on on the extension can be found on <a href="https://developer.ibm.com/bluemix/docs/set-up-continuous-delivery-ibm-containers/">IBM Bluemix Dev\u0e0f\u0e39\u0130\u0131\uff5c]</a>

CONTAINER_NAME_KEY=[G'Name\u0e0f\u0e39\u0130\u0131\uff5c]
CONTAINER_NAME_DESC=[G'\uff34\uff48\uff45 \uff42\uff41\uff53\uff45 \uff4e\uff41\uff4d\uff45 \uff4f\uff46 \uff54\uff48\uff45 \uff43\uff4f\uff4e\uff54\uff41\uff49\uff4eer or group that will be started.  This can also be set on the stage environment.\u0e0f\u0e39\u0130\u0131\uff5c]
COMMAND_KEY=[G'\uff24\uff45\uff50\uff4coyer Script\u0e0f\u0e39\u0130\u0131\uff5c]
COMMAND_DESC=[G'\uff24\uff45\uff46\uff41\uff55\uff4c\uff54 \uff53\uff43\uff52\uff49pt uesd to start a container.\u0e0f\u0e39\u0130\u0131\uff5c]

DEPLOY_TYPE_KEY=[G'\uff24\uff45\uff50\uff4c\uff4f\uff59ment strategy\u0e0f\u0e39\u0130\u0131\uff5c]
DEPLOY_TYPE_DESC=[G'\uff34\uff48\uff45 \uff54\uff59\uff50\uff45 \uff4f\uff46 \uff44\uff45\uff53\uff49\uff52\uff45\uff44 \uff44\uff45\uff50\uff4c\uff4f\uff59\uff4d\uff45\uff4e\uff54.  \uff34\uff48\uff49\uff53 \uff43\uff41\uff4e \uff42\uff45 \uff41\uff4c\uff53\uff4f \uff53\uff45\uff54 using the DEPLOY_TYPE environment property.  Currently this only supports red_black and clean deployment strategies.\u0e0f\u0e39\u0130\u0131\uff5c]
PORT_KEY=[G'PORT\u0e0f\u0e39\u0130\u0131\uff5c]
PORT_DESC=[G'\uff30\uff55\uff42\uff4c\uff49\uff53\uff48\uff45\uff44 \uff50\uff4f\uff52\uff54(\uff53) \uff46\uff4f\uff52 \uff54\uff48\uff45 \uff43\uff4f\uff4e\uff54\uff41\uff49\uff4e\uff45\uff52 \uff4f\uff52 \uff43\uff4f\uff4e\uff54\uff41\uff49\uff4e\uff45\uff52 \uff47\uff52\uff4f\uff55\uff50.  \uff29\uff46 \uff59ou wish to expose more than a single port use a comma as a delimiter. For example, '80,443' will expose both port 80 and port 443.\u0e0f\u0e39\u0130\u0131\uff5c]
ARGS_KEY=[G'\uff2f\uff50\uff54\uff49\uff4f\uff4e\uff41\uff4c \uff24eploy Arguments\u0e0f\u0e39\u0130\u0131\uff5c]
ARGS_DESC=[G'\uff25\uff58\uff54\uff52\uff41 \uff41\uff52\uff47\uff55\uff4d\uff45\uff4e\uff54\uff53 \uff54\uff4f \uff50\uff41\uff53\uff53 \uff54\uff4f \uff54\uff48\uff45 \uff44\uff45\uff50\uff4c\uff4f\uff59\uff4d\uff45\uff4e\uff54 \uff43\uff4f\uff4d\uff4d\uff41\uff4e\uff44.  \uff26\uff4f\uff52 \uff45\uff58\uff41\uff4d\uff50\uff4c\uff45, \uff54\uff4f \uff45\uff58\uff50\uff4f\uff53\uff45 \uff45\uff4e\uff56\uff49\uff52onment variables in the container "varname=somevalue" and "some_other_var=other_value", this would be set to "--env varname=somevalue --env some_other_var=other_value".\u0e0f\u0e39\u0130\u0131\uff5c]
